suturo_planning_executive/doc/suturo-planning-executive2.org
#+TITLE: The SUTURO-PLANNING-EXECUTIVE package
#+AUTHOR: CLOD
#+EMAIL: your@email.here
#+LINK: hs http://www.lispworks.com/reference/HyperSpec//%s
#+STARTUP: showall
#+OPTIONS: toc:4 H:10 @:t tags:nil

# link target 2: <<suturo-planning-executive>>
# link target: <<package suturo-planning-executive>>


* Internal Package: =suturo-planning-executive=                          :package:

- Uses:
    [[package cram-language][cram-language]], [[package cram-language-designator
    support][cram-language-designator-support]], [[package cram-plan-library][cram
    plan-library]], [[package cram-roslisp-common][cram-roslisp-common]], [[package
    roslisp][roslisp]], [[package cram-designators][cram-designators]], [[package
    suturo-planning-pm-perception][suturo-planning-pm-perception]], [[package
    suturo-planning-pm-manipulation][suturo-planning-pm-manipulation]], [[package
    suturo-planning-constants][suturo-planning-constants]], [[package suturo
    planning-planlib][suturo-planning-planlib]]
- Used by:
    None.

** Description

Not documented.


** External Symbols




*** External Functions

-----

# link target 2: <<task-selector>>
# link target: <<function task-selector>>


**** Function: =task-selector=                                             :function:


***** Syntax

#+BEGIN_SRC lisp
(task-selector &optional (tsk task1_v1))
#+END_SRC


***** Description

Starts the plan for the task from the parameter server.

   If no task is set in the parameter server, the task given
   as argument will be started (default: task1_v1)



-----

# link target 2: <<task1>>
# link target: <<function task1>>


**** Function: =task1=                                                     :function:


***** Syntax

#+BEGIN_SRC lisp
(task1)
#+END_SRC


***** Description

Not documented.






** Internal Symbols




*** Internal Macros

-----

# link target 2: <<with-process-modules>>
# link target: <<macro with-process-modules>>


**** Macro: =with-process-modules=                                            :macro:


***** Syntax

#+BEGIN_SRC lisp
(with-process-modules
  &body
  body)
#+END_SRC


***** Description

Not documented.





*** Internal Functions

-----

# link target 2: <<call-service-state>>
# link target: <<function call-service-state>>


**** Function: =call-service-state=                                        :function:


***** Syntax

#+BEGIN_SRC lisp
(call-service-state service-name taskdata)
#+END_SRC


***** Description


Calls the service of the given service-name. Every state service has to accept an object of suturo_interface_msgs-srv:TaskDataService.
***** Arguments

- service-name :: The name of a state service has to start with suturo/state/. This argument needs the last part of the service name e.g: suturo/state/myAwesomeService -> myAwesomeService.
- taskdata :: The suturo_interface_msgs-msgs:Taskdata object that should be send to the service



-----

# link target 2: <<cram-task1>>
# link target: <<function cram-task1>>


**** Function: =cram-task1=                                                :function:


***** Syntax

#+BEGIN_SRC lisp
(cram-task1 &rest call-args435)
#+END_SRC


***** Description

Top level plan for task 1 of the euroc challenge



-----

# link target 2: <<cram-task1-tmp>>
# link target: <<function cram-task1-tmp>>


**** Function: =cram-task1-tmp=                                            :function:


***** Syntax

#+BEGIN_SRC lisp
(cram-task1-tmp &rest call-args2262)
#+END_SRC


***** Description


Temporary top-level plan to start the task 1. The argument *start_sim* should be T if the function is called the first time. Set the argument to nil
if the plan should try to continue from the last state.
***** Arguments

- start_sim :: T if the simulation should be started



-----

# link target 2: <<init-simulation>>
# link target: <<function init-simulation>>


**** Function: =init-simulation=                                           :function:


***** Syntax

#+BEGIN_SRC lisp
(init-simulation &rest call-args3054)
#+END_SRC


