suturo_planning_executive/doc/suturo-planning-executive2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The SUTURO-PLANNING-EXECUTIVE package</title>
<!-- 2015-03-13 Fr 14:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="CLOD" />
</head>
<body>
<div id="content">
<h1 class="title">The SUTURO-PLANNING-EXECUTIVE package</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Internal Package: <code>suturo-planning-executive</code></a>
<ul>
<li><a href="#sec-1-1">1.1. Description</a></li>
<li><a href="#sec-1-2">1.2. External Symbols</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. External Functions</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1. Function: <code>task-selector</code></a></li>
<li><a href="#sec-1-2-1-2">1.2.1.2. Function: <code>task1</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Internal Symbols</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Internal Macros</a>
<ul>
<li><a href="#sec-1-3-1-1">1.3.1.1. Macro: <code>with-process-modules</code></a></li>
</ul>
</li>
<li><a href="#sec-1-3-2">1.3.2. Internal Functions</a>
<ul>
<li><a href="#sec-1-3-2-1">1.3.2.1. Function: <code>call-service-state</code></a></li>
<li><a href="#sec-1-3-2-2">1.3.2.2. Function: <code>cram-task1</code></a></li>
<li><a href="#sec-1-3-2-3">1.3.2.3. Function: <code>cram-task1-tmp</code></a></li>
<li><a href="#sec-1-3-2-4">1.3.2.4. Function: <code>init-simulation</code></a></li>
<li><a href="#sec-1-3-2-5">1.3.2.5. Function: <code>is-map-scanned</code></a></li>
<li><a href="#sec-1-3-2-6">1.3.2.6. Function: <code>is-robot-at-location</code></a></li>
<li><a href="#sec-1-3-2-7">1.3.2.7. Function: <code>is-robot-looking-at</code></a></li>
<li><a href="#sec-1-3-2-8">1.3.2.8. Function: <code>no</code></a></li>
<li><a href="#sec-1-3-2-9">1.3.2.9. Function: <code>parse-yaml</code></a></li>
<li><a href="#sec-1-3-2-10">1.3.2.10. Function: <code>poses-equal-p</code></a></li>
<li><a href="#sec-1-3-2-11">1.3.2.11. Function: <code>task1-tmp</code></a></li>
<li><a href="#sec-1-3-2-12">1.3.2.12. Function: <code>yaml-cb</code></a></li>
<li><a href="#sec-1-3-2-13">1.3.2.13. Function: <code>yaml-publisher</code></a></li>
<li><a href="#sec-1-3-2-14">1.3.2.14. Function: <code>yes</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Index</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. C</a></li>
<li><a href="#sec-1-4-2">1.4.2. I</a></li>
<li><a href="#sec-1-4-3">1.4.3. N</a></li>
<li><a href="#sec-1-4-4">1.4.4. P</a></li>
<li><a href="#sec-1-4-5">1.4.5. T</a></li>
<li><a href="#sec-1-4-6">1.4.6. W</a></li>
<li><a href="#sec-1-4-7">1.4.7. Y</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Colophon</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Internal Package: <code>suturo-planning-executive</code></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Uses:
<i>cram-language</i>, <i>cram-language-designator-support</i>, <i>cram
plan-library</i>, <i>cram-roslisp-common</i>, <i>roslisp</i>, <i>cram-designators</i>, <i>suturo-planning-pm-perception</i>, <i>suturo-planning-pm-manipulation</i>, <i>suturo-planning-constants</i>, <i>suturo-planning-planlib</i>
</li>
<li>Used by:
None.
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Not documented.
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> External Symbols</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> External Functions</h4>
<div class="outline-text-4" id="text-1-2-1">
<hr  />
</div>


<div id="outline-container-sec-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> Function: <code>task-selector</code></h5>
<div class="outline-text-5" id="text-1-2-1-1">
</div><div id="outline-container-sec-1-2-1-1-1" class="outline-6">
<h6 id="sec-1-2-1-1-1"><span class="section-number-6">1.2.1.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-2-1-1-1">
<div class="org-src-container">

<pre class="src src-lisp">(task-selector &amp;optional (tsk task1_v1))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-2" class="outline-6">
<h6 id="sec-1-2-1-1-2"><span class="section-number-6">1.2.1.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-2-1-1-2">
<p>
Starts the plan for the task from the parameter server.
</p>

<p>
If no task is set in the parameter server, the task given
as argument will be started (default: task1<sub>v1</sub>)
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-2-1-2" class="outline-5">
<h5 id="sec-1-2-1-2"><span class="section-number-5">1.2.1.2</span> Function: <code>task1</code></h5>
<div class="outline-text-5" id="text-1-2-1-2">
</div><div id="outline-container-sec-1-2-1-2-1" class="outline-6">
<h6 id="sec-1-2-1-2-1"><span class="section-number-6">1.2.1.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-2-1-2-1">
<div class="org-src-container">

<pre class="src src-lisp">(task1)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-1-2-2" class="outline-6">
<h6 id="sec-1-2-1-2-2"><span class="section-number-6">1.2.1.2.2</span> Description</h6>
<div class="outline-text-6" id="text-1-2-1-2-2">
<p>
Not documented.
</p>
</div>
</div>
</div>
</div>
</div>






<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Internal Symbols</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Internal Macros</h4>
<div class="outline-text-4" id="text-1-3-1">
<hr  />
</div>


<div id="outline-container-sec-1-3-1-1" class="outline-5">
<h5 id="sec-1-3-1-1"><span class="section-number-5">1.3.1.1</span> Macro: <code>with-process-modules</code></h5>
<div class="outline-text-5" id="text-1-3-1-1">
</div><div id="outline-container-sec-1-3-1-1-1" class="outline-6">
<h6 id="sec-1-3-1-1-1"><span class="section-number-6">1.3.1.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-1-1-1">
<div class="org-src-container">

<pre class="src src-lisp">(with-process-modules
  &amp;body
  body)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-1-1-2" class="outline-6">
<h6 id="sec-1-3-1-1-2"><span class="section-number-6">1.3.1.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-1-1-2">
<p>
Not documented.
</p>
</div>
</div>
</div>
</div>





<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Internal Functions</h4>
<div class="outline-text-4" id="text-1-3-2">
<hr  />
</div>


<div id="outline-container-sec-1-3-2-1" class="outline-5">
<h5 id="sec-1-3-2-1"><span class="section-number-5">1.3.2.1</span> Function: <code>call-service-state</code></h5>
<div class="outline-text-5" id="text-1-3-2-1">
</div><div id="outline-container-sec-1-3-2-1-1" class="outline-6">
<h6 id="sec-1-3-2-1-1"><span class="section-number-6">1.3.2.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-1-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-service-state service-name taskdata)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-1-2" class="outline-6">
<h6 id="sec-1-3-2-1-2"><span class="section-number-6">1.3.2.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-1-2">
<p>
Calls the service of the given service-name. Every state service has to accept an object of suturo<sub>interface</sub><sub>msgs</sub>-srv:TaskDataService.
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2-1-3" class="outline-6">
<h6 id="sec-1-3-2-1-3"><span class="section-number-6">1.3.2.1.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-2-1-3">
<dl class="org-dl">
<dt> service-name </dt><dd>The name of a state service has to start with suturo/state/. This argument needs the last part of the service name e.g: suturo/state/myAwesomeService -&gt; myAwesomeService.
</dd>
<dt> taskdata </dt><dd>The suturo<sub>interface</sub><sub>msgs</sub>-msgs:Taskdata object that should be send to the service
</dd>
</dl>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-2" class="outline-5">
<h5 id="sec-1-3-2-2"><span class="section-number-5">1.3.2.2</span> Function: <code>cram-task1</code></h5>
<div class="outline-text-5" id="text-1-3-2-2">
</div><div id="outline-container-sec-1-3-2-2-1" class="outline-6">
<h6 id="sec-1-3-2-2-1"><span class="section-number-6">1.3.2.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-2-1">
<div class="org-src-container">

<pre class="src src-lisp">(cram-task1 &amp;rest call-args435)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-2-2" class="outline-6">
<h6 id="sec-1-3-2-2-2"><span class="section-number-6">1.3.2.2.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-2-2">
<p>
Top level plan for task 1 of the euroc challenge
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-3" class="outline-5">
<h5 id="sec-1-3-2-3"><span class="section-number-5">1.3.2.3</span> Function: <code>cram-task1-tmp</code></h5>
<div class="outline-text-5" id="text-1-3-2-3">
</div><div id="outline-container-sec-1-3-2-3-1" class="outline-6">
<h6 id="sec-1-3-2-3-1"><span class="section-number-6">1.3.2.3.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-3-1">
<div class="org-src-container">

<pre class="src src-lisp">(cram-task1-tmp &amp;rest call-args2262)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-3-2" class="outline-6">
<h6 id="sec-1-3-2-3-2"><span class="section-number-6">1.3.2.3.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-3-2">
<p>
Temporary top-level plan to start the task 1. The argument <b>start<sub>sim</sub></b> should be T if the function is called the first time. Set the argument to nil
if the plan should try to continue from the last state.
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2-3-3" class="outline-6">
<h6 id="sec-1-3-2-3-3"><span class="section-number-6">1.3.2.3.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-2-3-3">
<dl class="org-dl">
<dt> start<sub>sim</sub> </dt><dd>T if the simulation should be started
</dd>
</dl>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-4" class="outline-5">
<h5 id="sec-1-3-2-4"><span class="section-number-5">1.3.2.4</span> Function: <code>init-simulation</code></h5>
<div class="outline-text-5" id="text-1-3-2-4">
</div><div id="outline-container-sec-1-3-2-4-1" class="outline-6">
<h6 id="sec-1-3-2-4-1"><span class="section-number-6">1.3.2.4.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-4-1">
<div class="org-src-container">

<pre class="src src-lisp">(init-simulation &amp;rest call-args3054)
</pre>
</div>
</div>
</div>
