suturo_planning_executive/doc/suturo-planning-executive2.org
***** Description


Initialize the simulation:
- Start simulation
- Start manipulation
- Start perception
- Start classifier



-----

# link target 2: <<is-map-scanned>>
# link target: <<function is-map-scanned>>


**** Function: =is-map-scanned=                                            :function:


***** Syntax

#+BEGIN_SRC lisp
(is-map-scanned)
#+END_SRC


***** Description


Checks if the a map is scanned. A map is scanned if more than 95% of the map is known.
***** Return Value

A boolean (T or nil) whether the map is scanned.



-----

# link target 2: <<is-robot-at-location>>
# link target: <<function is-robot-at-location>>


**** Function: =is-robot-at-location=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(is-robot-at-location temp-loc)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<is-robot-looking-at>>
# link target: <<function is-robot-looking-at>>


**** Function: =is-robot-looking-at=                                       :function:


***** Syntax

#+BEGIN_SRC lisp
(is-robot-looking-at location)
#+END_SRC


***** Description

Checks if the robot is looking at the given location



-----

# link target 2: <<no>>
# link target: <<function no>>


**** Function: =no=                                                        :function:


***** Syntax

#+BEGIN_SRC lisp
(no &rest args)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<parse-yaml>>
# link target: <<function parse-yaml>>


**** Function: =parse-yaml=                                                :function:


***** Syntax

#+BEGIN_SRC lisp
(parse-yaml)
#+END_SRC


***** Description

Subscribes the yaml publisher and sets environment:*yaml* to stay informed about changes



-----

# link target 2: <<poses-equal-p>>
# link target: <<function poses-equal-p>>


**** Function: =poses-equal-p=                                             :function:


***** Syntax

#+BEGIN_SRC lisp
(poses-equal-p pose-1 pose-2 &key (position-threshold 0.01)
               (angle-threshold (/ pi 180)))
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<task1-tmp>>
# link target: <<function task1-tmp>>


**** Function: =task1-tmp=                                                 :function:


***** Syntax

#+BEGIN_SRC lisp
(task1-tmp &optional start_sim)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<yaml-cb>>
# link target: <<function yaml-cb>>


**** Function: =yaml-cb=                                                   :function:


***** Syntax

#+BEGIN_SRC lisp
(yaml-cb msg)
#+END_SRC


***** Description


Callback for the function [[parse-yaml]]. Sets the variable environment:*yaml*.



-----

# link target 2: <<yaml-publisher>>
# link target: <<function yaml-publisher>>


**** Function: =yaml-publisher=                                            :function:


***** Syntax

#+BEGIN_SRC lisp
(yaml-publisher)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<yes>>
# link target: <<function yes>>


**** Function: =yes=                                                       :function:


***** Syntax

#+BEGIN_SRC lisp
(yes &rest args)
#+END_SRC


***** Description

Not documented.






** Index

 [[index C][C]]  [[index I][I]]  [[index N][N]]  [[index P][P]]  [[index T][T]]
 [[index W][W]]  [[index Y][Y]]  


*** C


# link target: <<index C>>
- [[function call-service-state][=suturo-planning-executive::call-service
  state=]], Function
- [[function cram-task1][=suturo-planning-executive::cram-task1=]], Function
- [[function cram-task1-tmp][=suturo-planning-executive::cram-task1-tmp=]],
  Function



*** I


# link target: <<index I>>
- [[function init-simulation][=suturo-planning-executive::init-simulation=]],
  Function
- [[function is-map-scanned][=suturo-planning-executive::is-map-scanned=]],
  Function
- [[function is-robot-at-location][=suturo-planning-executive::is-robot-at
  location=]], Function
- [[function is-robot-looking-at][=suturo-planning-executive::is-robot-looking
  at=]], Function



*** N


# link target: <<index N>>
- [[function no][=suturo-planning-executive::no=]], Function



*** P


# link target: <<index P>>
- [[function parse-yaml][=suturo-planning-executive::parse-yaml=]], Function
- [[function poses-equal-p][=suturo-planning-executive::poses-equal-p=]],
  Function



*** T


# link target: <<index T>>
- [[function task-selector][=suturo-planning-executive:task-selector=]],
  Function
- [[function task1][=suturo-planning-executive:task1=]], Function
- [[function task1-tmp][=suturo-planning-executive::task1-tmp=]], Function



