suturo_planning_executive/doc/suturo-planning-executive2.html


<div id="outline-container-sec-1-3-2-4-2" class="outline-6">
<h6 id="sec-1-3-2-4-2"><span class="section-number-6">1.3.2.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-4-2">
<p>
Initialize the simulation:
</p>
<ul class="org-ul">
<li>Start simulation
</li>
<li>Start manipulation
</li>
<li>Start perception
</li>
<li>Start classifier
</li>
</ul>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-5" class="outline-5">
<h5 id="sec-1-3-2-5"><span class="section-number-5">1.3.2.5</span> Function: <code>is-map-scanned</code></h5>
<div class="outline-text-5" id="text-1-3-2-5">
</div><div id="outline-container-sec-1-3-2-5-1" class="outline-6">
<h6 id="sec-1-3-2-5-1"><span class="section-number-6">1.3.2.5.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-5-1">
<div class="org-src-container">

<pre class="src src-lisp">(is-map-scanned)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-5-2" class="outline-6">
<h6 id="sec-1-3-2-5-2"><span class="section-number-6">1.3.2.5.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-5-2">
<p>
Checks if the a map is scanned. A map is scanned if more than 95% of the map is known.
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2-5-3" class="outline-6">
<h6 id="sec-1-3-2-5-3"><span class="section-number-6">1.3.2.5.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1-3-2-5-3">
<p>
A boolean (T or nil) whether the map is scanned.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-6" class="outline-5">
<h5 id="sec-1-3-2-6"><span class="section-number-5">1.3.2.6</span> Function: <code>is-robot-at-location</code></h5>
<div class="outline-text-5" id="text-1-3-2-6">
</div><div id="outline-container-sec-1-3-2-6-1" class="outline-6">
<h6 id="sec-1-3-2-6-1"><span class="section-number-6">1.3.2.6.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-6-1">
<div class="org-src-container">

<pre class="src src-lisp">(is-robot-at-location temp-loc)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-6-2" class="outline-6">
<h6 id="sec-1-3-2-6-2"><span class="section-number-6">1.3.2.6.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-6-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-7" class="outline-5">
<h5 id="sec-1-3-2-7"><span class="section-number-5">1.3.2.7</span> Function: <code>is-robot-looking-at</code></h5>
<div class="outline-text-5" id="text-1-3-2-7">
</div><div id="outline-container-sec-1-3-2-7-1" class="outline-6">
<h6 id="sec-1-3-2-7-1"><span class="section-number-6">1.3.2.7.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-7-1">
<div class="org-src-container">

<pre class="src src-lisp">(is-robot-looking-at location)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-7-2" class="outline-6">
<h6 id="sec-1-3-2-7-2"><span class="section-number-6">1.3.2.7.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-7-2">
<p>
Checks if the robot is looking at the given location
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-8" class="outline-5">
<h5 id="sec-1-3-2-8"><span class="section-number-5">1.3.2.8</span> Function: <code>no</code></h5>
<div class="outline-text-5" id="text-1-3-2-8">
</div><div id="outline-container-sec-1-3-2-8-1" class="outline-6">
<h6 id="sec-1-3-2-8-1"><span class="section-number-6">1.3.2.8.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-8-1">
<div class="org-src-container">

<pre class="src src-lisp">(no &amp;rest args)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-8-2" class="outline-6">
<h6 id="sec-1-3-2-8-2"><span class="section-number-6">1.3.2.8.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-8-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-9" class="outline-5">
<h5 id="sec-1-3-2-9"><span class="section-number-5">1.3.2.9</span> Function: <code>parse-yaml</code></h5>
<div class="outline-text-5" id="text-1-3-2-9">
</div><div id="outline-container-sec-1-3-2-9-1" class="outline-6">
<h6 id="sec-1-3-2-9-1"><span class="section-number-6">1.3.2.9.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-9-1">
<div class="org-src-container">

<pre class="src src-lisp">(parse-yaml)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-9-2" class="outline-6">
<h6 id="sec-1-3-2-9-2"><span class="section-number-6">1.3.2.9.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-9-2">
<p>
Subscribes the yaml publisher and sets environment:*yaml* to stay informed about changes
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-10" class="outline-5">
<h5 id="sec-1-3-2-10"><span class="section-number-5">1.3.2.10</span> Function: <code>poses-equal-p</code></h5>
<div class="outline-text-5" id="text-1-3-2-10">
</div><div id="outline-container-sec-1-3-2-10-1" class="outline-6">
<h6 id="sec-1-3-2-10-1"><span class="section-number-6">1.3.2.10.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-10-1">
<div class="org-src-container">

<pre class="src src-lisp">(poses-equal-p pose-1 pose-2 &amp;key (position-threshold 0.01)
               (angle-threshold (/ pi 180)))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-10-2" class="outline-6">
<h6 id="sec-1-3-2-10-2"><span class="section-number-6">1.3.2.10.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-10-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-11" class="outline-5">
<h5 id="sec-1-3-2-11"><span class="section-number-5">1.3.2.11</span> Function: <code>task1-tmp</code></h5>
<div class="outline-text-5" id="text-1-3-2-11">
</div><div id="outline-container-sec-1-3-2-11-1" class="outline-6">
<h6 id="sec-1-3-2-11-1"><span class="section-number-6">1.3.2.11.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-11-1">
<div class="org-src-container">

<pre class="src src-lisp">(task1-tmp &amp;optional start_sim)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-11-2" class="outline-6">
<h6 id="sec-1-3-2-11-2"><span class="section-number-6">1.3.2.11.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-11-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-12" class="outline-5">
<h5 id="sec-1-3-2-12"><span class="section-number-5">1.3.2.12</span> Function: <code>yaml-cb</code></h5>
<div class="outline-text-5" id="text-1-3-2-12">
</div><div id="outline-container-sec-1-3-2-12-1" class="outline-6">
<h6 id="sec-1-3-2-12-1"><span class="section-number-6">1.3.2.12.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-12-1">
<div class="org-src-container">

<pre class="src src-lisp">(yaml-cb msg)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-12-2" class="outline-6">
<h6 id="sec-1-3-2-12-2"><span class="section-number-6">1.3.2.12.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-12-2">
<p>
Callback for the function <i>parse-yaml</i>. Sets the variable environment:*yaml*.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-13" class="outline-5">
<h5 id="sec-1-3-2-13"><span class="section-number-5">1.3.2.13</span> Function: <code>yaml-publisher</code></h5>
<div class="outline-text-5" id="text-1-3-2-13">
</div><div id="outline-container-sec-1-3-2-13-1" class="outline-6">
<h6 id="sec-1-3-2-13-1"><span class="section-number-6">1.3.2.13.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-13-1">
<div class="org-src-container">

<pre class="src src-lisp">(yaml-publisher)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-13-2" class="outline-6">
<h6 id="sec-1-3-2-13-2"><span class="section-number-6">1.3.2.13.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-13-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-14" class="outline-5">
<h5 id="sec-1-3-2-14"><span class="section-number-5">1.3.2.14</span> Function: <code>yes</code></h5>
<div class="outline-text-5" id="text-1-3-2-14">
</div><div id="outline-container-sec-1-3-2-14-1" class="outline-6">
<h6 id="sec-1-3-2-14-1"><span class="section-number-6">1.3.2.14.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-14-1">
<div class="org-src-container">

<pre class="src src-lisp">(yes &amp;rest args)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-14-2" class="outline-6">
<h6 id="sec-1-3-2-14-2"><span class="section-number-6">1.3.2.14.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-14-2">
<p>
Not documented.
</p>
</div>
</div>
</div>
</div>
</div>






<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Index</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<i>C</i>  <i>I</i>  <i>N</i>  <i>P</i>  <i>T</i>
<i>W</i>  <i>Y</i>  
</p>
</div>


<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> C</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><i><code>suturo-planning-executive::call-service
  state</code></i>, Function
</li>
<li><i><code>suturo-planning-executive::cram-task1</code></i>, Function
</li>
<li><i><code>suturo-planning-executive::cram-task1-tmp</code></i>,
Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> I</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><i><code>suturo-planning-executive::init-simulation</code></i>,
Function
</li>
<li><i><code>suturo-planning-executive::is-map-scanned</code></i>,
Function
</li>
<li><i><code>suturo-planning-executive::is-robot-at
  location</code></i>, Function
</li>
<li><i><code>suturo-planning-executive::is-robot-looking
  at</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> N</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li><i><code>suturo-planning-executive::no</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> P</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li><i><code>suturo-planning-executive::parse-yaml</code></i>, Function
</li>
<li><i><code>suturo-planning-executive::poses-equal-p</code></i>,
Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> T</h4>
<div class="outline-text-4" id="text-1-4-5">
<ul class="org-ul">
<li><i><code>suturo-planning-executive:task-selector</code></i>,
Function
</li>
<li><i><code>suturo-planning-executive:task1</code></i>, Function
</li>
<li><i><code>suturo-planning-executive::task1-tmp</code></i>, Function
</li>
</ul>
</div>
</div>
